#1შექმენით პროგრამა, რომელსაც გადასცემთ სიას, სადაც გექნებათ მთელი რიცხვები. თქვენი დავალებაა, რომ ამ სიის ორი მინიმალური რიცხვის ჯამი დააბრუნოთ: ([5, 8, 12, 18, 22]), 13), ([7, 15, 12, 18, 22]), 19), ([25, 42, 12, 18, 22]), 30)

list1 = [8,19,4,9,2,33]





#შექმენით პროგრამა რომელსაც გადასცემთ მთელი რიცხვების სიას. შემდეგ უნდა მოახდინოთ გაფილტვრა: ახალ სიაში გადაიტანოთ მარტო ლუწი რიცხვები. ბოლოს კი დააბრუნოთ ახალი სია. test cases: [1, 2, 3, 4] -> [2, 4]

list = [1,2,3,4,5,6,7,8,9,10]
list1 = []

for num in list:
  if num % 2 == 0:
    list1.append(num)
print(list1)



#დემეტრე როგორც აღმოჩნდა არ იცოდი რა არის append აფენდ ავტომატურად ამატებს კონკრეტულ სიაში ელემენტებს, დაიმახსოვრე.
#რამდენი ელემენტიც არის სიაში იმდენჯერ გადაუვლის ფორ ციკლი..
#


  
  

