#1. მომხმარებელს შემოატანინეთ ნებისმიერი სიტყვა. თუ მისი სიგრძე აღემატება სამს, დაბეჭდეთ მისი პირველი სამი ასო. ხოლო თუ ნაკლებია ან ტოლი სამის, დაბეჭდეთ სიტყვის პირველი ასო.

word = input("Please enter a word: ")
if len(word) > 3:
    print(word[0:3])
elif len(word) <= 3:
    print(word[0])

#2. for ციკლით შექმენით 10-იდან 20-ის ჩათვლით არსებული მთელი რიცხვების სია. შემდეგ გამოიყენეთ slicing, სადაც სტეპი იქნება 2-ის ტოლი.


list1 = []
for i in range(10, 21):
    list1.append(i)
print(list1[::2])

#3. მომხმარებელს შემოატანინეთ სიტყვა. შემდეგ გამოიყენეთ ნასწავლი მასალა და შეაბრუნეთ ის.

name = input("please enter a word: ")
print(name[::-1])

c = ['$', '£', '€', '¥']
print(c[-3:-1])
    
